
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-12.11.0-20250604155202" -> "packer-debian-12.11.0-20250604231946" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.152" -> (known after apply)
      ~ default_ipv6_address   = "2a02:14c:62d1:1800::1e82" -> (known after apply)
      ~ id                     = "pve/qemu/102" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-master-01"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.152" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;master" -> "k3s,master"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
      ~ vmid                   = 102 -> (known after apply)
        # (36 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:0f:eb:5e" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:dc:23:ec" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "619f98b7-a535-427e-8c1e-56ca1da43ae1" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-12.11.0-20250604155202" -> "packer-debian-12.11.0-20250604231946" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.150" -> (known after apply)
      ~ default_ipv6_address   = "2a02:14c:62d1:1800::1418" -> (known after apply)
      ~ id                     = "pve/qemu/100" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-worker-01"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.150" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;worker" -> "k3s,worker"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
      ~ vmid                   = 100 -> (known after apply)
        # (36 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:46:7c:79" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:92:da:1a" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "291ec908-0b73-4308-bcf8-e946068c0724" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-12.11.0-20250604155202" -> "packer-debian-12.11.0-20250604231946" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.148" -> (known after apply)
      ~ default_ipv6_address   = "2a02:14c:62d1:1800::1e74" -> (known after apply)
      ~ id                     = "pve/qemu/101" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-worker-02"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.148" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;worker" -> "k3s,worker"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
      ~ vmid                   = 101 -> (known after apply)
        # (36 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:5d:75:36" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:9f:78:a8" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "b8629bf7-94f8-4ea2-b79d-3cf23ab92e6e" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ master_default_ipv4_addresses = [
      ~ "10.9.9.152" -> (known after apply),
    ]
  ~ worker_default_ipv4_addresses = [
      ~ "10.9.9.150" -> (known after apply),
      ~ "10.9.9.148" -> (known after apply),
    ]

```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*